{"data":{"site":{"siteMetadata":{"title":"William Lindner, 2 n's","author":"William Lindner"}},"markdownRemark":{"id":"01780e2d-e46c-5af4-a355-356555c5a985","html":"<p>I recently read the book <a href=\"https://www.amazon.com/Zahir-Novel-Obsession-Paulo-Coelho/dp/0060832819/ref=pd_sbs_14_1?_encoding=UTF8&#x26;pd_rd_i=0060832819&#x26;pd_rd_r=0Z65F0F7C7N9RXXR06CP&#x26;pd_rd_w=7fKft&#x26;pd_rd_wg=K9qSH&#x26;psc=1&#x26;refRID=0Z65F0F7C7N9RXXR06CP\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">The Zahir</a>. I wouldn’t say it was my favorite book, but I liked it, and a few things stood out to me. Particularly this excerpt. It’s from the climax of the book. The narrator realizes what he’s been chasing his whole life and how an obsession has kept him from making choices for himself.</p>\n<blockquote>\n<p>The Zahir?</p>\n<p>Yes, it had disappeared, but now I realized that the Zahir was more than a man obsessed with an object, with a vein in the marble of one of the twelve hundred columns in the mosque in Cordoba, as Borges puts it, or, as in my own painful case for the last two years, with a woman in Central Asia. The Zahir was a fixation on everything that had been passed from generation to generation; it left no question unanswered; it took up all the space; it never allowed us even to consider the possibility that things could change.</p>\n<p>The all-powerful Zahir seemed to be born with every human being and to gain full strength in childhood, imposing rules that would thereafter always be respected:</p>\n<p>People who are different are dangerous; they belong to another tribe; they want our lands and our women.</p>\n<p>We must marry, have children, reproduce the species.</p>\n<p>Love is only a small thing, enough for one person, and any suggestion that the heart might be larger than this is considered perverse.</p>\n<p>When we marry, we are authorized to take possession of the other person, body and soul.</p>\n<p>We must do jobs we detest because we are part of an organized society, and if everyone did what they wanted to do, the world would come to a standstill.</p>\n<p>We must buy jewelry; it identifies us with our tribe, just as body piercing identifies those of a different tribe.</p>\n<p>We must be amusing at all times and sneer at those who express their real feelings; it’s dangerous for a tribe to allow its members to show their feelings.</p>\n<p>We must at all costs avoid saying no because people prefer those who always say yes, and this allows us to survive in hostile territory.</p>\n<p>What other people think is more important than what we feel.</p>\n<p>Never make a fuss - it might attract the attention of an enemy tribe.</p>\n<p>If you behave differently, you will be expelled from the tribe because you could infect others and destroy something that was extremely difficult to organize in the first place.</p>\n<p>We must always consider the look of our new cave, and if we don’t have a clear idea of our own, then we must call in a decorator who will do his best to show others what good taste we have.</p>\n<p>We must eat three meals a day, even if we’re not hungry, and when we fail to fit the current ideal of beauty we must fast, even if we’re starving.</p>\n<p>We must dress according to the dictates of fashion, make love whether we feel like it or not, kill in the name of our country, wish time away so that retirement comes more quickly, elect politicians, complain about the cost of living, change our hairstyle, criticize anyone who is different, go to a religious service on Sunday, Saturday, or Friday, depending on our religion, and there beg forgiveness for our sins and puff ourselves up with pride because we know the truth and despise the other tribe, who worships a false god.</p>\n<p>Our children must follow in our footsteps; after all, we are older and know about the world.</p>\n<p>We must have a university degree even if we never get a job in the area of knowledge we were forced to study.</p>\n<p>We must study things that we will never use, but which someone told us were important to know: algebra, trigonometry, the code of Hammurabi.</p>\n<p>We must never make our parents sad, even if this means giving up everything that makes us happy.</p>\n<p>We must play music quietly, talk quietly, weep in private, because I am the all-powerful Zahir, who lays down the rules and determines the distance between railway tracks, the meaning of success, the best way to love, the importance of rewards.</p>\n</blockquote>","frontmatter":{"title":"An Excerpt from The Zahir","date":"August 13, 2017"}}},"pageContext":{"slug":"/excerpt-from-the-zahir/"}}