{"data":{"site":{"siteMetadata":{"title":"William Lindner, 2 n's","author":"William Lindner"}},"markdownRemark":{"id":"13dc5a24-3631-58c9-a22a-28f775aba8b1","html":"<p>I’ve been practicing Sanshou kickboxing since October 2017 at a local Kung Fu facility here in San Francisco. I’ve already learned a few things about myself and the benefits of exercise and disciplined practice along the way. For most of my life, I wasn’t athletic; I thought of exercise as a chore. Kickboxing is the first exercise I can describe as enjoyable. The classes are 45 minutes and usually start with a warm up, then we each pair up with another person in the class. I love that pairing is such an essential part of these kickboxing classes because I pair program all day at Pivotal and it expanded my perspective about what a pair is. In class one person holds pads, the other punches and kicks those pads, then you switch places and do the exercises again. It requires trust, patience, and communication to work well together. It’s also somewhat meditative: if you lose focus while your pair is practicing, you might get hit in the face so you must train your mind to not get distracted.</p>\n<h3>Breathing</h3>\n<p>One of the most important things I have learned through kickboxing is how to breathe properly. Breathing in and out at the right time takes practice. Breathe in while preparing to kick, breathe out with the kick. Through this practice I realized pretty quickly that my breathing was very shallow. Instead of taking big deep breaths to fill up my belly, I was trying to look calm while breathing hard. Those things don’t mix. Kickboxing helped me become more aware of an insecurity I had about looking worn out from breathing deeply. Whether it was middle school soccer or PE, I had picked up the association between breathing hard and getting criticized for not being in shape. All that taught me was to not breathe hard. Once I became aware of that bad association I breathed freely at the rhythm my body required.</p>\n<p>Seeing the immediate benefits of controlled breathing lead to learning more about practices like the <a href=\"https://www.wimhofmethod.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Wim Hof Method</a> and <a href=\"http://www.holotropic.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">holotropic breathwork</a>. The Wim Hof Method is a breathing exercise for controlling the immune response especially in cold temperatures. Holotropic breathwork uses deep breathing to enter non-ordinary states of consciousness and heal from past trauma stored in the body. Both of these practices have been fascinating to study and fit in nicely with my kickboxing experience.</p>\n<h3>First work on form, then increase speed, then develop power</h3>\n<p>I see it all the time. A young or inexperienced person comes to class. They get so excited and nervous to impress everyone around them and want to look really powerful. So they start flailing around uncontrollably and either wear themselves out, or worse, end up hurting themselves. It’s almost always because they try to start out with a lot of power and never develop the fundamentals of correct form. Practicing correct form is boring. Turning your foot in just the right way, or turning your fist at just the right time. Or pulling your leg back after a roundhouse kick or bringing your fist back to your face after a punch. These movements are boring when all you want to do is kick or punch the pad as hard as you can. But these things are necessary. And if you skip over learning good form, you’re doing yourself a huge disfavor in the long run. Eventually you’ll hit a wall with your bad form and never increase speed and power. You must first get the form down, practice that over and over and over until it’s the only way you move. Then you can start to go faster. You might be lightly hitting the pad, barely making a sound. Looking like you’re wasting your time. You barely even make contact because you’re throwing and pulling so quickly. But do that for a while and eventually you will start hitting harder because you built on the right foundation.</p>\n<h3>Fight or flight can be calmed</h3>\n<p>Whenever our mind perceives a threat, it triggers what’s called the “Fight or Flight” response. Our body releases stress hormones like adrenaline in order to deal with a perceived threat. That reaction prepares us for jumping and flailing and running and generally moving around to deal with the threat. Being under stress leads to digestive problems, increased risk of heart disease and the other effects of <a href=\"http://www.youngdiggers.com.au/fight-or-flight#downside\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">chronic stress</a>. Humans picked up this trait along the evolutionary path. Even though we don’t have the same threats as early humans living in the savanna, we have the same response. Driving to work and someone cuts you off. Making a mistake and a group of people laugh at you. Harsh construction noises. These are all things that could create a fear response. A subconscious feeling of fear. Our feelings are our feelings whether we want them or not. How we react to those feelings is what’s important. In class, when a stranger punches or kicks at me while I block, a lot of fear responses get triggered. This immediately feels frightening, and requires me to stay in the moment and pay close attention to protect myself, but also feels extremely satisfying and confidence boosting afterwards. Kickboxing helps me to recognize a fight or flight biological response and gives me an outlet to let some of those stress hormones out. When the inevitable fear response comes up in daily life, I don’t feel it as much. It doesn’t overtake me. I still get stressed out, I just don’t feel as overwhelmed by it.</p>\n<p>I’m thankful I made a commitment to practicing kickboxing. I want to keep going and continue to challenge myself. It never becomes easy because my only adversary is myself. Every time I improve, I find more to learn. This fits my worldview about life. The work is never over. There will always be more to learn and do.</p>","frontmatter":{"title":"Lessons Learned Kickboxing","date":"January 22, 2019"}}},"pageContext":{"slug":"/lessons-learned-kickboxing/"}}